{
  "(error {0})": "(kļūda {0})",
  "The file/directory could not be found.": "Datne/katalogs netika atrasts.",
  "The file/directory could not be read.": "Nevar nolasīt datni/katalogu.",
  "Files larger than {0} MB cannot be opened in {APP_NAME}.": "{APP_NAME} nevar atvērt datnes, lielākas par {0} MB.",
  "The target directory cannot be modified.": "Izvēlētais katalogs nevar tikt pārveidots.",
  "The permissions do not allow you to make modifications.": "Jums nav atļaujas veikt izmaiņas.",
  "The file has been modified outside of {APP_NAME}.": "Šī datne ir pārveidota ārpus {APP_NAME}.",
  "Unknown encoding format": "{APP_NAME} šobrīd atbalsta tikai UTF-8 kodējuma teksta datnes.",
  "The file or directory already exists.": "Datne vai katalogs jau eksistē.",
  "file": "datne",
  "File": "Datne",
  "directory": "katalogs",
  "Directory": "Katalogs",
  "Directory names": "Katalogu nosaukumi",
  "Filenames": "Datņu nosaukumi",
  "Filename": "Datnes nosaukums",
  "Directory Name": "Kataloga nosaukums",
  "Error Loading Project": "Kļūda, ielādējot projektu",
  "An error occurred when showing the open file dialog. (error {0})": "Radās kļūda, rādot datņu atvēršanas dialogu. (kļūda {0})",
  "An error occurred when trying to load the directory <span class='dialog-filename'>{0}</span>. (error {1})": "Radās kļūda, ielādējot katalogu <span class='dialog-filename'>{0}</span>. (error {1})",
  "An error occurred when reading the contents of the directory <span class='dialog-filename'>{0}</span>. (error {1})": "Radās kļūda, nolasot kataloga saturu <span class='dialog-filename'>{0}</span>. (error {1})",
  "Error Opening File": "Kļūda, verot datni",
  "An error occurred when trying to open the file <span class='dialog-filename'>{0}</span>. {1}": "Radās kļūda, verot datni <span class='dialog-filename'>{0}</span>. {1}",
  "An error occurred when trying to open the following files:": "Radās kļūda, verot šīs datnes:",
  "Error Reloading Changes From Disk": "Kļūda, pārlādējot izmaiņas no diska",
  "An error occurred when trying to reload the file <span class='dialog-filename'>{0}</span>. {1}": "Radās kļūda, pārlādējot datni <span class='dialog-filename'>{0}</span>. {1}",
  "Error Saving File": "Kļūda, saglabājot datni",
  "An error occurred when trying to save the file <span class='dialog-filename'>{0}</span>. {1}": "Radās kļūda, saglabājot datni <span class='dialog-filename'>{0}</span>. {1}",
  "Error Renaming {0}": "Kļūda, pārdēvējot {0}",
  "An error occurred when trying to rename the {2} <span class='dialog-filename'>{0}</span>. {1}": "Radās kļūda, pārdēvējot {2} <span class='dialog-filename'>{0}</span>. {1}",
  "The file or directory is not part of the currently opened project. Unfortunately, only project files can be renamed at this point.": "Datne vai katalogs nav daļa no pašlaik atvērtā projekta. Diemžēl šobrīd var pārdēvēt tikai projekta datnes.",
  "Error Deleting {0}": "Kļūda, dzēšot {0}",
  "An error occurred when trying to delete the {2} <span class='dialog-filename'>{0}</span>. {1}": "Radās kļūda, dzēšot {2} <span class='dialog-filename'>{0}</span>. {1}",
  "Invalid {0}": "Nederīgs {0}",
  "{0} cannot use any system reserved words, end with dots (.) or use any of the following characters: <code class='emphasized'>{1}</code>": "{0} nevar izmantot sistēmas rezervētos vārdus, kas beidzas ar punktu (.) vai izmantot šādus simbolus: <code class='emphasized'>{1}</code>",
  "A file or directory with the name <span class='dialog-filename'>{0}</span> already exists.": "Jau eksistē datne vai katalogs ar nosaukumu <span class='dialog-filename'>{0}</span> .",
  "Error Creating {0}": "Kļūda, veidojot {0}",
  "An error occurred when trying to create the {0} <span class='dialog-filename'>{1}</span>. {2}": "Radās kļūda, veidojot {0} <span class='dialog-filename'>{1}</span>. {2}",
  "Cannot open a folder at the same time as opening other files.": "Nevar atvērt mapi, kamēr tiek atvērtas citas datnes.",
  "Error Reading User Key Map": "Kļūda, lasot lietotāja atslēgu karti",
  "Your key map file is not valid JSON. The file will be opened so that you can correct the format.": "Atslēgu kartes datne nav derīga JSON datne. Datne tiks atvērta, lai Jūs varētu izlabot formātu.",
  "Your key map file is not a valid UTF-8 encoded text file and cannot be loaded": "Atslēgu karte nav derīga UTF-8 kodējuma teksta datne un nevar tikt ielādēta",
  "You cannot reassign shortcuts to these commands: {0}": "Nevar piešķirt saīsnes šīm komandām: {0}",
  "You cannot reassign these shortcuts: {0}": "Nevar piešķirt šīs saīsnes: {0}",
  "You are reassigning multiple shortcuts to these commands: {0}": "Tiek piešķirtas vairākas saīsnes šīm komandām: {0}",
  "You have multiple bindings of these shortcuts: {0}": "Šīm saīsnēm ir vairākas piesaistes: {0}",
  "These shortcuts are invalid: {0}": "Šīs saīsnes nav derīgas: {0}",
  "You are assigning shortcuts to nonexistent commands: {0}": "Tiek piešķirtas saīsnes neeksistējošām komandām: {0}",
  "Error Reading Preferences": "Kļūda, lasot iestatījumus",
  "Your preferences file is not valid JSON. The file will be opened so that you can correct the format. You will need to restart {APP_NAME} for the changes to take effect.": "Iestatījumu datne nav derīga JSON datne. Datne tiks atvērta, lai Jūs varētu izlabot formātu. Nepieciešams restartēt {APP_NAME}, lai izmaiņas stāstos spēkā.",
  "Your project preferences file is not valid JSON. The file will be opened so that you can correct the format. You will need to reload the project for the changes to take effect.": "Iestatījumu datne nav derīga JSON datne. Datne tiks atvērta, lai Jūs varētu izlabot formātu. Nepieciešams pārlādēt projektu, lai izmaiņas stāstos spēkā.",
  "Oops! {APP_NAME} Doesn't Run in Browsers Yet.": "Ups! {APP_NAME} vēl nedarbojas pārlūkā.",
  "{APP_NAME} is built in HTML, but right now it runs as a desktop app so you can use it to edit local files. Please use the application shell in the <b>github.com/adobe/brackets-shell</b> repo to run {APP_NAME}.": "{APP_NAME} ir būvēta HTML, bet šobrīd strādā kā darbvirsmas lietotne, tāpēc to var izmantot, lai rediģētu lokālās datnes. Lūdzu, izmantojiet lietotnes čaulu <b>github.com/adobe/brackets-shell</b> repozitorijā, lai palaistu {APP_NAME}.",
  "Error Indexing Files": "Kļūda, indeksējot datnes",
  "This project contains more than 30,000 files. Features that operate across multiple files may be disabled or behave as if the project is empty. <a href='https://github.com/adobe/brackets/wiki/Large-Projects'>Read more about working with large projects</a>.": "Šis projekts ietver vairāk nekā 30000 datņu. Funkcijas, kas darbojas vairākās datnēs, var tikt atspējotas vai darboties tā, it kā projekts būtu tukšs. <a href='https://github.com/adobe/brackets/wiki/Large-Projects'> Lasīt vairāk par strādāšanu ar lieliem projektiem</a>.",
  "Error Launching Browser": "Kļūda, palaižot pārlūku",
  "The Google Chrome browser could not be found. Please make sure it is installed.": "Pārlūks Google Chrome netika atrasts. Pārliecinieties, ka tas ir instalēts.",
  "An error occurred when launching the browser. (error {0})": "Radās kļūda, palaižot pārlūku. (kļūda {0})",
  "Live Preview Error": "Tiešā priekšskatījuma kļūda",
  "Connecting to Browser": "Savienojas ar pārlūku",
  "In order for Live Preview to connect, Chrome needs to be relaunched with remote debugging enabled.<br /><br />Would you like to relaunch Chrome and enable remote debugging?<br /><br />": "Lai savienotos ar tiešo priekšskatījumu, nepieciešams pārlādēt Chrome ar iespējotu attālo atkļūdošanu.<br /><br />Vai vēlaties pārlādēt Chrome un iespējot attālo atkļūdošanu?<br /><br />",
  "Unable to load Live Preview page.": "Neizdevās ielādēt tiešā priekšskatījuma lapu.",
  "Open an HTML file or make sure there is an index.html file in your project in order to launch live preview.": "Atveriet HTML datni vai pārliecinieties, ka jūsu projektā ir datne index.html, lai palaistu tiešo priekšskatījumu.",
  "To launch live preview with a server-side file, you need to specify a Base URL for this project.": "Lai palaistu tiešo priekšskatījumu ar serverī importētu datni, nepieciešams norādīt šī projekta bāzes URL.",
  "Error starting up the HTTP server for live preview files. Please try again.": "Kļūda, startējot HTTP serveri tiešā priekšskatījuma datnēm. Lūdzu, mēģiniet vēlreiz. ",
  "Welcome to Live Preview!": "Laipni lūgts tiešajā priekšskatījumā!",
  "Live Preview connects {APP_NAME} to your browser. It launches a preview of your HTML file in the browser, then updates the preview instantly as you edit your code.<br /><br />In this early version of {APP_NAME}, Live Preview only works with <strong>Google Chrome</strong> and updates live as you edit <strong>CSS or HTML files</strong>. Changes to JavaScript files are automatically reloaded when you save.<br /><br />(You'll only see this message once.)": "Tiešais priekšskatījums savieno {APP_NAME} ar pārlūku. Tas palaiž HTML datnes priekšskatījumu pārlūkā, tad atjaunina priekšskatījumu, kad tiek rediģēts kods.<br /><br />Šajā agrīnajā {APP_NAME} versijā tiešais priekšskatījums darbojas tikai ar <strong>Google Chrome</strong> un atjauninās, kad tiek rediģētas <strong>CSS vai HTML datnes</strong>. Izmaiņas JavaScript datnēs tiek automātiski pārlādētas saglabājot.<br /><br />(Šis paziņojums paradīsies tikai vienreiz.)",
  "For more information, see <a href='{0}' title='{0}'>Troubleshooting Live Preview connection errors</a>.": "Sīkākai informācijai skatiet <a href='{0}' title='{0}'>Tiešā priekšskatījuma savienojuma kļūdu novēršana</a>.",
  "Live Preview": "Tiešais priekšskatījums",
  "Live Preview: Connecting…": "Tiešais priekšskatījums: savienojas…",
  "Live Preview: Initializing…": "Tiešais priekšskatījums: inicializē…",
  "Disconnect Live Preview": "Izslēgt tiešo priekšskatījumu",
  "Live Preview (save file to refresh)": "Tiešais priekšskatījums (saglabājiet datni, lai atsvaidzinātu)",
  "Live Preview (not updating due to syntax error)": "Tiešais priekšskatījums (netiek atjaunināts sintakses kļūdas dēļ)",
  "Live Preview was canceled because the browser's developer tools were opened": "Tiešais priekšskatījums tika atcelts, jo bija atvērti pārlūka izstrādātāja rīki",
  "Live Preview was canceled because the page was closed in the browser": "Tiešais priekšskatījums tika atcelts, jo lapa tika aizvērta pārlūkā",
  "Live Preview was canceled because the browser navigated to a page that is not part of the current project": "Tiešais priekšskatījums tika atcelts, jo pārlūks pārvietojās uz lapu, kas nav daļa no šī projekta",
  "Live Preview was canceled for an unknown reason ({0})": "Tiešais priekšskatījums tika atcelts nezināma iemesla dēļ ({0})",
  "Save Changes": "Saglabāt izmaiņas",
  "Do you want to save the changes you made in the document <span class='dialog-filename'>{0}</span>?": "Vai vēlaties saglabāt veiktās izmaiņas dokumentā <span class='dialog-filename'>{0}</span>?",
  "Do you want to save your changes to the following files?": "Vai vēlaties saglabāt izmaiņas šajās datnēs?",
  "External Changes": "Ārējas izmaiņas",
  "Confirm Delete": "Apstiprināt dzēšanu",
  "Are you sure you want to delete the folder <span class='dialog-filename'>{0}</span>?": "Vai tiešām vēlaties izdzēst mapi <span class='dialog-filename'>{0}</span>?",
  "File Deleted": "Datne izdzēsta",
  "<span class='dialog-filename'>{0}</span> has been modified on disk outside of {APP_NAME}.<br /><br />Do you want to save the file and overwrite those changes?": "<span class='dialog-filename'>{0}</span> ir pārveidots diskā ārpus {APP_NAME}.<br /><br />Vai vēlaties saglabāt datni un pārrakstīt šīs izmaiņas?",
  "<span class='dialog-filename'>{0}</span>