{
  "(error {0})": "(error {0})",
  "The file/directory could not be found.": "No se pudo encontrar el archivo/directorio.",
  "The file/directory could not be read.": "No se pudo leer el archivo/directorio.",
  "Files larger than {0} MB cannot be opened in {APP_NAME}.": "Los archivos de más de {0} MB no se pueden abrir en {APP_NAME}.",
  "The target directory cannot be modified.": "El directorio de destino no se puede modificar.",
  "The permissions do not allow you to make modifications.": "Los permisos no permiten hacer modificaciones.",
  "The file has been modified outside of {APP_NAME}.": "El archivo fue modificado fuera de {APP_NAME}.",
  "Unknown encoding format": "{APP_NAME} actualmente solo soporta archivos codificados como UTF-8.",
  "The file or directory already exists.": "El archivo ya existe.",
  "file": "archivo",
  "File": "Archivo",
  "directory": "directorio",
  "Directory": "directorio",
  "Directory names": "nombres de directorios",
  "Filenames": "nombres de archivos",
  "Filename": "nombre de archivo",
  "Directory Name": "nombre de directorio",
  "Error Loading Project": "Error abriendo el proyecto",
  "An error occurred when showing the open file dialog. (error {0})": "Ha ocurrido un error al mostrar el aviso de apertura de archivo. (error {0})",
  "An error occurred when trying to load the directory <span class='dialog-filename'>{0}</span>. (error {1})": "Ha ocurrido un error al intentar abrir el directorio <span class='dialog-filename'>{0}</span>. (error {1})",
  "An error occurred when reading the contents of the directory <span class='dialog-filename'>{0}</span>. (error {1})": "Ha ocurrido un error al leer los contenidos del directorio <span class='dialog-filename'>{0}</span>. (error {1})",
  "Error Opening File": "Error abriendo el archivo",
  "An error occurred when trying to open the file <span class='dialog-filename'>{0}</span>. {1}": "Ha ocurrido un error al intentar abrir el archivo <span class='dialog-filename'>{0}</span>. {1}",
  "An error occurred when trying to open the following files:": "Ha ocurrido un error al intentar abrir los siguientes archivos:",
  "Error Reloading Changes From Disk": "Error recargando cambios desde disco",
  "An error occurred when trying to reload the file <span class='dialog-filename'>{0}</span>. {1}": "Ha ocurrido un error al intentar recargar el archivo <span class='dialog-filename'>{0}</span>. {1}",
  "Error Saving File": "Error guardando el archivo",
  "An error occurred when trying to save the file <span class='dialog-filename'>{0}</span>. {1}": "Ha ocurrido un error al intentar guardar el archivo <span class='dialog-filename'>{0}</span>. {1}",
  "Error Renaming {0}": "Error renombrando el {0}",
  "An error occurred when trying to rename the {2} <span class='dialog-filename'>{0}</span>. {1}": "Ha ocurrido un error al intentar renombrar el {2} <span class='dialog-filename'>{0}</span>. {1}",
  "Error Deleting {0}": "Error eliminando el {0}",
  "An error occurred when trying to delete the {2} <span class='dialog-filename'>{0}</span>. {1}": "Ha ocurrido un error al intentar eliminar el {2} <span class='dialog-filename'>{0}</span>. {1}",
  "Invalid {0}": "{0} inválido",
  "{0} cannot use any system reserved words, end with dots (.) or use any of the following characters: <code class='emphasized'>{1}</code>": "Los {0} no pueden utilizar ninguna palabra reservada por el sistema, terminar con puntos (.) o utilizar cualquiera de los siguientes caracteres: <code class='emphasized'>{1}</code>",
  "A file or directory with the name <span class='dialog-filename'>{0}</span> already exists.": "Ya existe un archivo o directorio con el nombre <span class='dialog-filename'>{0}</span>.",
  "Error Creating {0}": "Error creando {0}",
  "An error occurred when trying to create the {0} <span class='dialog-filename'>{1}</span>. {2}": "Ha ocurrido un error al intentar crear el {0} <span class='dialog-filename'>{1}</span>. {2}",
  "Cannot open a folder at the same time as opening other files.": "No es posible abrir una carpeta y otros archivos al mismo tiempo.",
  "Error Reading User Key Map": "Ocurrió un error leyendo los atajos de teclado",
  "Your key map file is not valid JSON. The file will be opened so that you can correct the format.": "El archivo de atajos de teclado no tiene un formato JSON válido. El archivo se abrirá para que puedas corregir el formato.",
  "Your key map file is not a valid UTF-8 encoded text file and cannot be loaded": "El archivo de atajos de teclado no está codificado como UTF-8 y no puede ser cargado.",
  "You cannot reassign shortcuts to these commands: {0}": "No puedes reasignar atajos de teclado a los siguientes comandos: {0}",
  "You cannot reassign these shortcuts: {0}": "No puedes reasignar los siguientes atajos de teclado: {0}",
  "You are reassigning multiple shortcuts to these commands: {0}": "Estas reasignando múltiples atajos de teclado a los siguientes comandos: {0}",
  "You have multiple bindings of these shortcuts: {0}": "Hay múltiples apariciones de los siguientes atajos de teclado: {0}",
  "These shortcuts are invalid: {0}": "Los siguientes atajos de teclado son inválidos: {0}",
  "You are assigning shortcuts to nonexistent commands: {0}": "Estas asignando atajos de teclado a commandos inexistentes: {0}",
  "Error Reading Preferences": "Error leyendo las preferencias",
  "Your preferences file is not valid JSON. The file will be opened so that you can correct the format. You will need to restart {APP_NAME} for the changes to take effect.": "El archivo de preferencias no tiene un formato JSON válido. El archivo se abrirá para que puedas corregir el formato. Luego deberás reiniciar {APP_NAME} para que los cambios surtan efecto.",
  "Your project preferences file is not valid JSON. The file will be opened so that you can correct the format. You will need to reload the project for the changes to take effect.": "El archivo de preferencias para el proyecto no tiene un formato JSON válido. El archivo se abrirá para que puedas corregir el formato. Luego deberás recargar el proyecto para que los cambios surtan efecto.",
  "Oops! {APP_NAME} Doesn't Run in Browsers Yet.": "Vaya... parece que {APP_NAME} todavía no funciona en navegadores.",
  "{APP_NAME} is built in HTML, but right now it runs as a desktop app so you can use it to edit local files. Please use the application shell in the <b>github.com/adobe/brackets-shell</b> repo to run {APP_NAME}.": "{APP_NAME} está desarrollado en HTML, pero por ahora funciona como una aplicación de escritorio para que puedas editar archivos localmente. Por favor, utiliza la aplicación del repositorio <b>github.com/adobe/brackets-shell</b> para ejecutar {APP_NAME}.",
  "Error Indexing Files": "Error indexando archivos",
  "This project contains more than 30,000 files. Features that operate across multiple files may be disabled or behave as if the project is empty. <a href='https://github.com/adobe/brackets/wiki/Large-Projects'>Read more about working with large projects</a>.": "Este proyecto contiene más de 30.000 archivos. Funciones que operan sobre múltiples archivos pueden estar deshabilitadas o funcionar igual que si el proyecto estuviese vacío. <a href='https://github.com/adobe/brackets/wiki/Large-Projects'>Leer más acerca de cómo trabajar con proyectos grandes</a>.",
  "Error Launching Browser": "Error iniciando el navegador",
  "The Google Chrome browser could not be found. Please make sure it is installed.": "No se pudo encontrar el navegador Google Chrome. Por favor, asegúrate que esté instalado correctamente.",
  "An error occurred when launching the browser. (error {0})": "Ha ocurrido un error al iniciar el navegador. (error {0})",
  "Live Preview Error": "Error en la Vista previa dinámica",
  "Connecting to Browser": "Conectando con el navegador",
  "In order for Live Preview to connect, Chrome needs to be relaunched with remote debugging enabled.<br /><br />Would you like to relaunch Chrome and enable remote debugging?<br /><br />": "Para poder iniciar el modo de Vista previa dinámica, Chrome debe ser iniciado habilitando la depuración remota.<br><br>¿Quieres reiniciar Chrome y habilitar la depuración remota?<br><br>",
  "Unable to load Live Preview page.": "No se pudo cargar la página para la Vista previa dinámica.",
  "Open an HTML file or make sure there is an index.html file in your project in order to launch live preview.": "Abra un archivo HTML o asegúrate de que haya un index.html en tu proyecto para poder iniciar el modo de Vista previa dinámica.",
  "To launch live preview with a server-side file, you need to specify a Base URL for this project.": "Necesitas especificar una URL base en este proyecto para poder iniciar la Vista previa dinámica con archivos de servidor.",
  "Error starting up the HTTP server for live preview files. Please try again.": "Error iniciando el servidor HTTP para la Vista previa dinámica. Vuelve a intentarlo, por favor.",
  "Welcome to Live Preview!": "¡Bienvenido a la Vista previa dinámica!",
  "Live Preview connects {APP_NAME} to your browser. It launches a preview of your HTML file in the browser, then updates the preview instantly as you edit your code.<br /><br />In this 